section_1/perf/results/sleep/node_load_output.txt
> artillery "run" "./scenarios/sleep_load.yaml" "-e" "node"

Started phase 0 (Plain), duration: 20s @ 22:33:13(-0300) 2020-11-10
Report @ 22:33:24(-0300) 2020-11-10
Elapsed time: 10 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 22:33:33(-0300) 2020-11-10
Elapsed time: 20 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Started phase 1 (Ramp Up 1), duration: 10s @ 22:33:33(-0300) 2020-11-10
Report @ 22:33:43(-0300) 2020-11-10
Elapsed time: 30 seconds
  Scenarios launched:  40
  Scenarios completed: 14
  Requests completed:  14
  Mean response/sec: 5.95
  Response time (msec):
    min: 3001.9
    max: 3033.6
    median: 3005.1
    p95: 3028.2
    p99: 3033.6
  Codes:
    200: 14

Started phase 2 (Ramp Up 2), duration: 10s @ 22:33:44(-0300) 2020-11-10
Report @ 22:33:53(-0300) 2020-11-10
Elapsed time: 40 seconds
  Scenarios launched:  137
  Scenarios completed: 112
  Requests completed:  112
  Mean response/sec: 13.71
  Response time (msec):
    min: 3001.7
    max: 3036.1
    median: 3004.6
    p95: 3007
    p99: 3030.6
  Codes:
    200: 112

Started phase 3 (Ramp Up 3), duration: 10s @ 22:33:55(-0300) 2020-11-10
Report @ 22:34:04(-0300) 2020-11-10
Elapsed time: 50 seconds
  Scenarios launched:  239
  Scenarios completed: 205
  Requests completed:  205
  Mean response/sec: 23.82
  Response time (msec):
    min: 3001.7
    max: 3056.8
    median: 3004.7
    p95: 3008.4
    p99: 3018.8
  Codes:
    200: 205

Started phase 4 (Ramp Up 4), duration: 10s @ 22:34:05(-0300) 2020-11-10
Report @ 22:34:14(-0300) 2020-11-10
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  334
  Scenarios completed: 308
  Requests completed:  308
  Mean response/sec: 33.53
  Response time (msec):
    min: 3001.5
    max: 3042.7
    median: 3004.4
    p95: 3008.1
    p99: 3022.9
  Codes:
    200: 308

Started phase 5 (Ramp Up 5), duration: 10s @ 22:34:15(-0300) 2020-11-10
Report @ 22:34:24(-0300) 2020-11-10
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  426
  Scenarios completed: 397
  Requests completed:  397
  Mean response/sec: 42.64
  Response time (msec):
    min: 3001.4
    max: 3044.7
    median: 3004.3
    p95: 3007
    p99: 3014.9
  Codes:
    200: 397

Started phase 6 (Ramp Up 6), duration: 10s @ 22:34:26(-0300) 2020-11-10
Report @ 22:34:33(-0300) 2020-11-10
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  538
  Scenarios completed: 506
  Requests completed:  506
  Mean response/sec: 53.81
  Response time (msec):
    min: 3001.3
    max: 3013.7
    median: 3004
    p95: 3007.8
    p99: 3010.2
  Codes:
    200: 506

Started phase 7 (Ramp Up 7), duration: 10s @ 22:34:36(-0300) 2020-11-10
Report @ 22:34:44(-0300) 2020-11-10
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  640
  Scenarios completed: 609
  Requests completed:  609
  Mean response/sec: 64.04
  Response time (msec):
    min: 3001
    max: 3012.6
    median: 3003.6
    p95: 3006.4
    p99: 3009.8
  Codes:
    200: 609

Started phase 8 (Ramp Up 8), duration: 10s @ 22:34:46(-0300) 2020-11-10
Report @ 22:34:54(-0300) 2020-11-10
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  733
  Scenarios completed: 708
  Requests completed:  708
  Mean response/sec: 73.37
  Response time (msec):
    min: 3000.5
    max: 3019.2
    median: 3002.4
    p95: 3004.8
    p99: 3006.6
  Codes:
    200: 708

Started phase 9 (Ramp Up 9), duration: 10s @ 22:34:56(-0300) 2020-11-10
Report @ 22:35:03(-0300) 2020-11-10
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  825
  Scenarios completed: 791
  Requests completed:  791
  Mean response/sec: 82.58
  Response time (msec):
    min: 3000.4
    max: 3027.1
    median: 3002.4
    p95: 3005.1
    p99: 3009.5
  Codes:
    200: 791

Started phase 10 (Ramp Up 10), duration: 10s @ 22:35:06(-0300) 2020-11-10
Report @ 22:35:14(-0300) 2020-11-10
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  927
  Scenarios completed: 901
  Requests completed:  901
  Mean response/sec: 92.7
  Response time (msec):
    min: 3000.5
    max: 3019.5
    median: 3002.4
    p95: 3005.9
    p99: 3011.3
  Codes:
    200: 901

Started phase 11 (Ramp Up 11), duration: 10s @ 22:35:16(-0300) 2020-11-10
Report @ 22:35:24(-0300) 2020-11-10
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  1021
  Scenarios completed: 992
  Requests completed:  992
  Mean response/sec: 102.2
  Response time (msec):
    min: 3000.5
    max: 3028.4
    median: 3002.7
    p95: 3005.5
    p99: 3008.7
  Codes:
    200: 992

Started phase 12 (Ramp Up 12), duration: 10s @ 22:35:26(-0300) 2020-11-10
Report @ 22:35:34(-0300) 2020-11-10
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  1134
  Scenarios completed: 1095
  Requests completed:  1095
  Mean response/sec: 113.51
  Response time (msec):
    min: 3000.6
    max: 3031.3
    median: 3002.4
    p95: 3005.3
    p99: 3007.6
  Codes:
    200: 1095

Started phase 13 (Ramp Up 13), duration: 10s @ 22:35:36(-0300) 2020-11-10
Report @ 22:35:43(-0300) 2020-11-10
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  1225
  Scenarios completed: 1200
  Requests completed:  1200
  Mean response/sec: 122.62
  Response time (msec):
    min: 3000.5
    max: 3017.7
    median: 3002.6
    p95: 3005.9
    p99: 3008.8
  Codes:
    200: 1200

Started phase 14 (Ramp Up 14), duration: 10s @ 22:35:46(-0300) 2020-11-10
Report @ 22:35:54(-0300) 2020-11-10
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  1315
  Scenarios completed: 1287
  Requests completed:  1287
  Mean response/sec: 131.5
  Response time (msec):
    min: 3000.6
    max: 3022.8
    median: 3002.4
    p95: 3006.6
    p99: 3011.3
  Codes:
    200: 1287

Started phase 15 (Ramp Up 15), duration: 10s @ 22:35:56(-0300) 2020-11-10
Report @ 22:36:04(-0300) 2020-11-10
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  1421
  Scenarios completed: 1397
  Requests completed:  1397
  Mean response/sec: 142.14
  Response time (msec):
    min: 3000.4
    max: 3019
    median: 3002.4
    p95: 3006.5
    p99: 3009
  Codes:
    200: 1397

Started phase 16 (Ramp Up 16), duration: 10s @ 22:36:06(-0300) 2020-11-10
Report @ 22:36:13(-0300) 2020-11-10
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  1526
  Scenarios completed: 1493
  Requests completed:  1493
  Mean response/sec: 152.85
  Response time (msec):
    min: 3000.5
    max: 3029.5
    median: 3002.5
    p95: 3007.1
    p99: 3010
  Codes:
    200: 1493

Started phase 17 (Ramp Up 17), duration: 10s @ 22:36:16(-0300) 2020-11-10
Report @ 22:36:24(-0300) 2020-11-10
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  1635
  Scenarios completed: 1596
  Requests completed:  1596
  Mean response/sec: 163.4
  Response time (msec):
    min: 3000.2
    max: 3036.9
    median: 3002.5
    p95: 3007.9
    p99: 3012.7
  Codes:
    200: 1596

Started phase 18 (Ramp Up 18), duration: 10s @ 22:36:26(-0300) 2020-11-10
Report @ 22:36:33(-0300) 2020-11-10
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  1726
  Scenarios completed: 1687
  Requests completed:  1687
  Mean response/sec: 172.87
  Response time (msec):
    min: 3000.2
    max: 3028.9
    median: 3002.6
    p95: 3008.2
    p99: 3010.6
  Codes:
    200: 1687
  Errors:
    ECONNRESET: 36

Started phase 19 (Ramp Up 19), duration: 10s @ 22:36:36(-0300) 2020-11-10
Report @ 22:36:44(-0300) 2020-11-10
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  1825
  Scenarios completed: 1697
  Requests completed:  1697
  Mean response/sec: 182.4
  Response time (msec):
    min: 3000.5
    max: 3024.5
    median: 3002.7
    p95: 3009.3
    p99: 3013.6
  Codes:
    200: 1697
  Errors:
    ECONNRESET: 124

Started phase 20 (Ramp Up 20), duration: 10s @ 22:36:46(-0300) 2020-11-10
Report @ 22:36:54(-0300) 2020-11-10
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  1878
  Scenarios completed: 1693
  Requests completed:  1693
  Mean response/sec: 187.99
  Response time (msec):
    min: 3000.3
    max: 3026.6
    median: 3002.8
    p95: 3008.6
    p99: 3011.8
  Codes:
    200: 1693
  Errors:
    ECONNRESET: 187

Started phase 21 (Plain), duration: 20s @ 22:36:56(-0300) 2020-11-10
Report @ 22:37:04(-0300) 2020-11-10
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  540
  Scenarios completed: 978
  Requests completed:  978
  Mean response/sec: 54.15
  Response time (msec):
    min: 3000.3
    max: 3026.3
    median: 3002.8
    p95: 3008.2
    p99: 3011.4
  Codes:
    200: 978
  Errors:
    ECONNRESET: 72

Report @ 22:37:13(-0300) 2020-11-10
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 22:37:17(-0300) 2020-11-10
Elapsed time: 4 minutes, 3 seconds
  Scenarios launched:  0
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: NaN
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

All virtual users finished
Summary report @ 22:37:17(-0300) 2020-11-10
  Scenarios launched:  20085
  Scenarios completed: 19666
  Requests completed:  19666
  Mean response/sec: 91.27
  Response time (msec):
    min: 3000.2
    max: 3056.8
    median: 3002.7
    p95: 3007.5
    p99: 3011
  Scenario counts:
    Sleep (/sleep): 20085 (100%)
  Codes:
    200: 19666
  Errors:
    ECONNRESET: 419